#1. სიაში შეინახეთ 5 რიცხვი, შემდეგ კი დარპინტეთ პირველი და მეოთხე ელემენტების ნამრავლი.
#2. სიაში შეინახეთ 7 სტრინგი, შემდეგ დაპრინტეთ შუა სტრინგი.
#3. ცვლადში შეინახეთ სტრინგი, შემდეგ კი დაპრინტეთ ამ სტრინგის მხოლოდ მეორე ასო.
#4. ცვლადში შეინახეთ სტრინგი, შემდეგ კი დაპრინტეთ ამ სტრინგის მეორე და მესამე ასო.
# შექმენით ვენდინგ მანქანის თამაში პითონის მეშვეობით, როგორც გაკვეთილზე გავაკეთე, უნდა გქონდეთ პროდუქტები, მომხმარებელს უნდა შეეძლოს არჩევა რიცხვის მიხედვით, შემდეგ კი უნდა დაუპრინტოს ის პროდუქტი, რომელიც ამოირჩია, პროდუქტები შეინახეთ სიაში.


#1
number=[1,2,3,4,5]
print(number[0]*number[3])

#2
name=["kolia", "natasha", "vaska", "dito", "achiko","aolia","usupi"]
print(name[3])

#3
name=["chupachupsi"]
print(name[1,2])

#4
food=['xachapuri','xinkali','lobiani','kartopili','shaurma','pica']
print(food[input('which food do you want: 0-xachapuri 1-xinkali 2-lobiani 3-kartopili 4-shaurma 5-pica')])











































