#1
summer_break="fun"
print(summer_break)
#გავაკეთე ცვლადი რომელსაც სახელი დავარქვი summer_break შემდეგ მივანიჭე მნიშვნელობა და ამის მერე ეკრანზე გამოსატანად მივანიჭე პრინტ ფუნქცია 

#2

print(5 + 6)
print(7 - 5)
print(9 * 3)
print(4 / 5)
print(7 // 6)

#3

age=170
hight=858

print(age + hight)
print(age - hight)
print(age * hight)
print(age / hight)


#სავარჯიშოები
#1

#ბ) dog_name

#2

#case sensitive ენა ნიშნავს რომ დიდი და პატარა ასოებს შორის განსხვავებაა ანუ კომპიუტერი მას არ აღიქვამს როგორც ერთს მაგალითად dog და Dog კომპიუტერი ამ სიტყვებს სხვადასხვაად თვლის

#3

#კარგი პრაქტიკაა კომენტარების წერა რათა მოგვიანებით ჩვენ ან სხვა ადამიანმა ადვილად აღიქვას კოდი