 #1. დაწერეთ პროგრამა, რომელიც ამოწმებს, არის თუ არა რიცხვი დადებითი, უარყოფითი ან ნული და შესაბამისად დაპრინტეთ შეტყობინება.
#2. შექმენით პროგრამა, რომელიც ატანინებს მომხმარებლის ასაკს და განსაზღვრავს, აქვს თუ არა მას ხმის მიცემის უფლება (18 წლის და მეტი).
#3. სთხოვეთ მომხმარებელს შემოიტანოს მისი შეფასება (0-100) და დაპრინტეთ, ჩააბარა თუ არა მოსწავლემ (>= 50) ჩააბარა, თუ(< 50) ვერ.
#4. მომხმარებელს შემოატანინეთ რიცხვი, თუ ეს რიცხვი იქნება 10-ზე ნაკლები, დაუპრინტეთ რომ შემოიტანოს უფრო დიდი რიცხვი, თუ იქნება 10-ზე მეტი, დაუპრინტეთ რომ დავალება შეასრულა.
#5. დაწერეთ პროგრამა, რომელიც სთხოვს მომხმარებელს შეიყვანოს ორი რიცხვი და ამოწმებს რომელია უფრო დიდი, ან ტოლია თუ არა ისინი 




namber=int(input("anakonda "))
if namber>0:
    print("მეტია 0 ზე")


elif namber<0:
    print("ნაკლებია 0 ზე")
 
elif namber==0:
    print('ტოლია 0 ის ')


 
#2

age=int(input("anter your age! :"))
if age>18:
    print(age)

else:
    print("you does not give a point")



#3 

name=int(input("შემოიტანე შენი ქულა :  "))
if name:=<50
    print( ჩააბარე )
  else:
    print(vwuxvar sen ar xar 18 wlis)






















