#1. შექმენით სია, სადაც გექნებათ 4 სტრინგი, შემდეგ კი indexing-ის მეშვეობით გამოიტანეთ მეორე ელემენტი.
#2. შექმენით სია, სადაც გექნებათ 4 სტრინგი, შემდეგ კი შეცვალეთ მეორე ინდექსი სხვა მნიშვნელობით.
#3. შექმენით სია, სადაც გექნებათ 5 სტრინგი, შემდეგ კი slicing-ის მეშვეობით გამოიტანეთ პირველი და მეორე ელემენტი (positive indexing).
#4. შექმენით სია, სადაც გექნებათ 5 სტრინგი, შემდეგ კი slicing-ის მეშვეობით გამოიტანეთ პირველი და მეორე ელემენტი (negative indexing).
#5. შექმენით სია, სადაც გექნებათ 6 სტრინგი, შემდეგ კი slicing-ის მეშვეობით გამოიტანეთ პირველი და მეოთხე ელემენტი (negative indexing & positive indexing).

          #1
a = [1, 2, 3, 4, 5, 6, 7, 8, 9]

# მიიღეთ ელემენტები ინდექსიდან 1 ან  4 (excluded)
print(a[1:4])

a = [1, 2, 3, 4, 5, 6, 7, 8, 9]

          #2
# მიიღეთ ყველა ელემენტი სიაში
print(a[::])
print(a[:])


          #3

def greet(name):
    return f"Hello, {name}!"  




          #4

      # ეს არის ერთი ხაზის კომენტარი
print("Hello, World!")  # ეს ბეჭდავს შეტყობინებას


          #5


text  = input("Enter some text: ")

if text.islower():
    print(True)
else:
    print(False)