#```Python:

# 1. კომენტარების მეშვეობით ახსენი რა არის float/integer/string (by data fofxadze).

# 2. შექმენით ცვლადი სახელად name, სადაც მომხმარებელს input-ის მეშვეობით შემოატანინებთ სახელს, შემდეგ კი მისალმების მესიჯი, მაგალითად 'hello ' + (სახელი) (by data fofxadze).

# 3. შექმენით სამი ცვლადი, სამივეში შეინახეთ განსხვავებული ინფორმაციის ტიპები, შემდეგ კი დაპრინტეთ ისინი.

# 4. შექმენით ცვლადი სახელად user_name, სადაც მომხარებელს შემოატანინებთ სახელს, შემდეგ შექმენით ცვლადი სახელად last_name, სადაც მომხმარებელს შემოატანინებთ გვარს, ბოლოს დაუპრინტეთ მსგავსი მესიჯი: 'hello ' + (სახელი) + (გვარი).

# 5. კომენტარში ახსენით რა არის input და output, შემდეგ ახსენით რა არის კარგი პრაქტიკები და რომელი კარგი პრაქტიკები ვიცით. 

#1

#1float არის რიცხვი რომელიც არის წილადი
#2integer არის  მტელი რიცხვი
#3 string არის რაიმე ნაწერი რომელიც არის მოტავსებული ბრჭყალებში 



#2 
  
name=input("enter your name :")
print(f"hello {name}")


#3

last_name="Misterekiler201"
age=13
hight=14.1
print(last_name)
print(age)
print(hight)

#4


user_name=input("enter you name :")
last_name=input("enter you last-name :")
print(f'hello {user_name} {last_name}')


#5


#input არის გარედან შემავალი ინფორმაცია
#output არის შიგნიდან გამავალი ინფორმაცია
#კარგი პრაქტიკა არის კომენტარის წერა








