#```1. შექმენით სია, სადაც გექნებათ 7 სიტყვა, შემდეგ:

#* დადებითი ინდექსინგის მეშვეობით გამოიტანეთ მეორე და მესამე სიტყვა.

#* დადებითი ინდექსინგის მეშვეობით გამოიტანეთ მეხუთედან ყველა სიტყვა ბოლომდე.

#* უარყოფითი ინდექსინგის მეშვეობით გამოიტანეთ მეორე და მესამე სიტყვა.


#* უარყოფითი ინდექსინგის მეშვეობით გამოიტანეთ მეხუთედან ყველა სიტყვა ბოლომდე.

#* უაყოფითი და დადებითი ინდექსინგის, ორივეს მეშვეობით, გამოიტანეთ მესამე ელემენტიდან მეექსვეს ჩათვლით ყველა.

#* გამოიტანეთ სიის ყველა ელემენტი, დადებითი ინდექსინგის მეშვეობით.```


          #1
a = [1, 2, 3, 4, 5, 6, 7, 8, 9]

# მიიღეთ ელემენტები 1-დან 4-მდე (გამორიცხულია)
print(a[1:4])

     #2 
         
   a = [1, 2, 3, 4, 5, 6, 7, 8, 9]

# მიიღეთ ყველა ელემენტი სიაში
print(a[::])
print(a[:])
   
        #3
# სტრიქონის გამოცხადება
str = "Geeks for Geeks !"

# string-ის სიმბოლოზე წვდომა მე-0 ინდექსზე
print(str[0]) 

# string-ის სიმბოლოზე წვდომა მე-6 ინდექსზე
print(str[6]) 

# string-ის სიმბოლოზე წვდომა მე-10 ინდექსზე
print(str[10]) 
       
       
       #4
 #დადებითი რიცხვები

   numbers = [10, 20, 30, 40, 50]
print(numbers[0])  # Output: 10
print(numbers[1])  # Output: 20    

#უარყოფითი რიცხვები

numbers = [10, 20, 30, 40, 50]
print(numbers[-1])  # Output: 50
print(numbers[-2])  # Output: 40



numbers = [10, 20, 30, 40, 50]
#numbers = [10, 20, 30, 40, 50]
# Accessing the last element
print(numbers[-1])  # Output: 50


#ნეგატიური ინდექსირების გამოყენება სიებში

# ბოლო ელემენტზე წვდომა
print(numbers[-2])  # Output: 40
print(numbers[-1])  # Output: 50
# მეორე ბოლო ელემენტზე წვდომა
print(numbers[-2])  # Output: 40

#მაგალითა

numbers = [10, 20, 30, 40, 50]
#ბოლო სამი ელემენტის დაჭრა
print(numbers[-3:])  # Output: [30, 40, 50]

# დაჭრა მეორე ბოლოდან ბოლო ელემენტამდე
print(numbers[-2:])  # Output: [40, 50]
 

            #5

my_list = ['apple', 'banana', 'cherry', 'date']
print(my_list[0]) # output: 'apple'
print(my_list[1]) # output: 'banana'       


               