#--1. შექმენით ცვლადი საიდანაც თავიდან იქნება მისი მნიშვნელობა 10 შემდეგ გადააქციეთ ის სტრინგად და დაპრინტეთ

#2. შექმენით 2 ცვლადი სადაც გექნებათ სტრინგები შენახული, შემდეგ გადააგქციეთ ინტეჯერებად

#3.მომხმარებელს შემოატანინეთ float ტიპის მნიშვნელობა, ჯერ გაიგეთ მისი ტიპი შემდეგ დაპრინტეთ თვითონ ეს  float  -->



# 1. 
num = 10
num_str = str(num)
print(num_str)

# 2. 
str_num1 = "25"
str_num2 = "40"
int_num1 = int(str_num1)
int_num2 = int(str_num2)
print(int_num1, int_num2)

# 3. 
user_input = float(input("შეიყვანეთ რიცხვი: "))
print(type(user_input))
print(user_input)
