#1. კომენტარების მეშვეობით დეტალურად ახსენით, თუ რა არის ფუნქცია და ფუნქციის არგუმენტი.

#2. ჩამოწერე უკვე ნასწავლი ფუნქციის 3-4 მაგალითი.

#3. შექმენი for loop(), რომელიც 5-ჯერ გამოიტანს 'hello'-ს.

#4. შექმენი while loop(), რომელიც გამოიტანს 0,1,2,3 ციფრებს.





       #1

# მაგალითად  
                          
def my_function():
  print("Hello from a function")

#თითოეული ფუნქციის განსაზღვრას წინ უძღვის ველი კომენტარით, რომელიც იძლევა ფუნქციის სახელს, განმარტავს მის დანიშნულებას, განიხილავს თითოეული პარამეტრის მნიშვნელობას, აღწერს მის დაბრუნებულ მნიშვნელობას

       #2

#1 ჩამონტაჟებული ფუნქციები
#2 ფუნქციების შესავალი
#3 ფუნქციის სინტაქსი
#4 დარეკვის ანუ გამოძახების ფუნქციები




      #3


for x in range(5):
    print("Hello, world!") 
else:
    print("\nDone!")



     #4

x = 0
while x<=5:
  print(x)
  x += 1

  









