# 1. შექმენით ცვლადი სახელად name, სადაც მომხმარებელს input-ის მეშვეობით შემოატანინებთ სახელს, შემდეგ კი მისალმების მესიჯი, მაგალითად 'hello ' + (სახელი). 

#2. შექმენით სამი ცვლადი, სამივეში შეინახეთ განსხვავებული ინფორმაციის ტიპები, შემდეგ კი დაპრინტეთ ისინი.

#3. შექმენით ცვლადი სახელად user_name, სადაც მომხარებელს შემოატანინებთ სახელს, შემდეგ შექმენით ცვლადი სახელად last_name, სადაც მომხმარებელს შემოატანინებთ გვარს, ბოლოს დაუპრინტეთ მსგავსი მესიჯი: 'hello ' + (სახელი) + (გვარი). -->



#1
name = input("შეიყვანეთ თქვენი სახელი: ")
print("hello " + name)



#2
integer_value = 42          # მთელი რიცხვი
float_value = 3.14          # სამოტრეთული რიცხვი
string_value = "Python"     # ტექსტი

print(integer_value)
print(float_value)
print(string_value)





#3
user_name = input("შეიყვანეთ თქვენი სახელი: ")
last_name = input("შეიყვანეთ თქვენი გვარი: ")
print("hello " + user_name + " " + last_name)


