# Python:

# 1. შეინახეთ სამი ქალაქის სახელი ცალკე ცვლადში და დაპრინტეთ ისინი.

# 2. შეართეთ ორი სიტყვა (მაგ., სახელი და გვარი) და დაპრინტეთ სრული სახელი.

# 3. აიღეთ ორი რიცხვი და დაპრინტეთ მათი ჯამი, სხვაობა, ნამრავლი და განაყოფი.

# 4. მიანიჭეთ ერთი ცვლადის მნიშვნელობა მეორეს და დაპრინტეთ ორივე ცვლადი, რომ ნახოთ შედეგი.

# 5. შემოატანინეთ მომხმარებელს მისი საყვარელი ფერი და დაპრინტეთ წინადადება, რომელშიც ეწერება ეს ფერი.

# 6. შეინახეთ სტრინგი, მთელი რიცხვი და float სამ განსხვავებულ ცვლადში და დაპრინტეთ მათი ტიპები.

# 7. აიღეთ float რიცხვი, გადააკეთეთ იგი მთელ რიცხვად და შემდეგ დაპრინტეთ როგორც ორიგინალური float, ასევე გადაყვანილი მთელი რიცხვად.

# 8. შეინახეთ რიცხვი ცვლადში და შეამოწმეთ მისი მონაცემთა ტიპი `type()` ფუნქციით. დაპრინტეთ შედეგი.

# 9. ორ რიცხვზე შეასრულეთ  არითმეტიკული მოქმედებები (შეკრება, გამოკლება, გამრავლება, გაყოფა) და შედეგები შეინახეთ ცვლადებში. შედეგების დაპრინტეთ.

# 10. აიღეთ სამი სტრინგი და გააერთიანეთ ისინი ერთ წინადადებად. დაბეჭდეთ საბოლოო წინადადება.
#    აქ არის კიდევ 6 დავალება, რომლებიც ფოკუსირებულია შედარების ოპერატორებზე პირობითების გამოყენების გარეშე:

# 11. შეინახეთ ორი რიცხვი ცალკეულ ცვლადებში და გამოიყენეთ შედარების ოპერატორები (`<`, `>`, `<=`, `>=`, `==`, `!=`) შედარებისთვის. დაპრინტეთ თითოეული შედარების შედეგი.

# 12. შექმენით ცვლადები ორი სხვადასხვა ასაკისათვის. გამოიყენეთ შედარების ოპერატორები იმის შესამოწმებლად, არის თუ არა ერთი ასაკი მეორეზე დიდი ან მისი ტოლი. დაპრინტეთ შედეგი.

# 13. სამ ცვლადს მიანიჭეტ რიცხვითი მნიშვნელობები. გამოიყენეთ შედარების ოპერატორები, რათა შეამოწმოთ არის თუ არა პირველი ცვლადი მეორეზე ნაკლები და თუ მეორე მესამეზე ნაკლები. დაპრინტეთ შედეგები.

# 14. ცვლადში შეინახეთ ორი სხვადასხვა სტრინგი და შეადარეთ ისინი ტოლობის (`==`) და უტოლობა (`!=`) ოპერატორების გამოყენებით. დაპრინტეთ ამ შედარების შედეგები.

#1
goa="tbilisi"  
city="qutaisi"
levani="zestaponi"
print(goa)
print(city)
print(levani)

#2

name="irakli"
laste_name="gogiava+"
print(name+laste_name)

#3
age=14
hight=130

print (age + hight)
print (age - hight)
print (age * hight)
print (age / hight)




#4


goa ="cad"
lisenig='men'
print(goa+lisening)


#5

color = input("enter your favorite color")

print (f"your favorite color is {color}")


#6

barca=   55     
madrid=  44.1
sevilia="ramosi"
print (type(barca))
print (type(madrid))
print (type(sevilia))





#7
kolia=int(2.1)

print(kolia)


#8

irakli="genius"
print(type(irakli))


#9

irakili=14
achiko=14
print (achiko + irakli)
print (irakli - achiko)
print (achiko * irakli)
print (achiko / irakli)



#10

























