#1) შექმენით 5 ელემენტიანი სია და ამოაგდეთ მე-0-ე და მე-4-ე ინდექსზე მდგომი ელემენტები

#2) შექმენით 5 ელემენტიანი სია და მე-2-ე და მე-3-ე ინდეხებზე დაამატეთ 2 ელემენტი

#3) შექმენით 5 ელემენტიანი სია და მის ბოლოში დაამატეთ 3 ელემენტი. inspect-ი არ გამოიყენოთ
 
#4) შექმენით დიდი სია და დაითვალეთ მასში რამდენი ელემენტია

#1
my_list = [10, 20, 30, 40, 50]
removed_elements = [my_list.pop(0), my_list.pop(3)]
print(my_list)  # [20, 30, 40]
print(removed_elements)  # [10, 50]



#2
my_list = [10, 20, 30, 40, 50]
my_list.insert(2, 25)  # 30-ზე წინ 25-ის დამატება
my_list.insert(3, 35)  # 40-ზე წინ 35-ის დამატება
print(my_list)  # [10, 20, 25, 35, 30, 40, 50]


#3
my_list = [10, 20, 30, 40, 50]
my_list += [60, 70, 80]
print(my_list)  # [10, 20, 30, 40, 50, 60, 70, 80]


#4
my_list = [1] * 1000  # 1000 ელემენტის სია
print(len(my_list))  # 1000
